Repository: mkappus1/DatenmanagementMTHS24
Catalog: Woche 2/Skripte/TMX-EN-DE.tmx
Source language: de_ch
Languages: en_gb

source: Das IUED bietet eine breite Auswahl von Weiterbildungskursen, Seminaren, Zertifikatslehrgängen, Coachings und massgeschneiderten Programmen an.
en_gb: The Institute of Translation and Interpreting offers a wide range of continuing education courses, seminars, certificates of advanced study programmes, coaching and tailor-made modules.

source: Die Veranstaltungen werden von Dozierenden der ZHAW Zürcher Hochschule für Angewandte Wissenschaften geleitet, oft in Zusammenarbeit mit in- und ausländischen Fachleuten aus dem universitären Bereich oder aus der Berufspraxis.
en_gb: The courses are run by Zurich University of Applied Sciences faculty members, often in conjunction with experts from universities or professions in and outside Switzerland.

source: Die IUED-Weiterbildung konzipiert für Sie Angebote in den Sprachen
en_gb: The IUED can provide tailor-made continuing education courses in:

source: Absolventinnen und Absolventen des Instituts für Übersetzen und Dolmetschen
en_gb: Graduates from the Institute of Translation and Interpreting

source: Absolventinnen und Absolventen von Fachhochschulen und Universitäten
en_gb: University of Applied Sciences graduates and university graduates

source: Englisch
en_gb: English

source: Berufsleute aus verschiedenen Bereichen
en_gb: Practitioners from various professions

source: Unternehmen, die sich für die Professionalität ihrer Mitarbeitenden einsetzen
en_gb: Companies keen to further the professional competence of their employees

source: Französisch
en_gb: French

source: Italienisch
en_gb: Italian

source: Spanisch
en_gb: Spanish

source: in Kombination mit den Fachbereichen Recht und Wirtschaft.
en_gb: which are offered in conjunction with the Law and Economics Faculties.

source: Sprachmittlung – Übersetzen, dolmetschen, kommunizieren
en_gb: Linguistic intermediation – translation, interpreting, communication

source: Hervorgegangen aus der "Dolmetscherschule Zürich" (DOZ) befindet sich das Institut für Übersetzen und Dolmetschen heute zentral gelegen in der neuen "Bildungsstadt Winterthur".
en_gb: Having evolved from the Dolmetscherschule Zürich (Zurich Interpreters’ School), or DOZ, today’s Institute of Translation and Interpreting occupies a central location in the new university town that Winterthur has now become.

source: Es steht mit seinen rund 60 Mitarbeiterinnen und Mitarbeitern aus neun Nationen stellvertretend für die sprachliche und kulturelle Vielfalt der Stadt und der ganzen Schweiz.
en_gb: Employing a staff of some 60 people from nine different nations, the Institute embodies the linguistic and cultural diversity not only of the town of Winterthur, but of Switzerland as a whole.

source: Diese Vielfalt zu nutzen und auf verschiedensten Ebenen und mit unterschiedlichster Zielrichtung zwischen verschiedenen Sprachen bzw. Fachbereichen und Sprache zu vermitteln, ist unsere Herausforderung:
en_gb: The challenge for us is to make the most of this diversity and to facilitate linguistic communication – on numerous levels, with a multiplicity of content, between languages and between different specialist fields.

source: Die professionelle Sprachmittlung ist unsere Kompetenz.
en_gb: Professional linguistic intermediation is our field of expertise.

source: Durch die Tätigkeit in verschiedenen gesellschaftlichen Kontexten (Privatwirtschaft, Behörden, Schulen und Wissenschaft) verbinden unsere Dozierenden und wissenschaftlichen MitarbeiterInnen Praxis und Wissenschaft in optimaler Weise.
en_gb: Through the work they do in a variety of social contexts (business, public authorities, schools and science), our faculty and scientific staff ideally combine scientific theory and its practical application.

source: Sie verfügen über ein breites Spektrum an praktischen und theoretischen Kenntnissen und Erfahrungen, die sie in den Studiengängen (mit aktuell über 350 Studierenden) und in Weiterbildungskursen (mit über 700 Absolvierenden im Jahr) weitergeben und die die Grundlage bilden für wissenschaftlich fundierte Beratung.
en_gb: They possess a broad base of practical and theoretical knowledge which they put to work not only in the Institute’s degree courses (currently attended by over 350 students) and in its vocational training (with more than 700 participants currently completing individual course modules each year), but also in the various scientifically based consultancy initiatives the Institute undertakes.

source: MAS Master of Advanced Studies
en_gb: Master of Advanced Studies

source: Ein Weiterbildungsmaster ist ein berufsbegleitendes Studium.
en_gb: A Master of Advanced Studies programme is a course of study offered to students in full-time employment.

source: Weiterbildungs-Masterprogramme dauern 3-4 Semester und schliessen mit einem Master of Advanced Studies MAS (teilweise auch mit einem Executive Master) ab.
en_gb: Continuing education masters programmes last 3-4 semesters and culminate, on graduation, in the award of a Master of Advanced Studies degree (or, in some instances, an Executive Master degree).

source: Aktuell bietet das Departement einen Weiterbildungs-Master an in
en_gb: Currently, the School of Applied Linguistics offers a continuing education master's programme in

source: CAS Certificate of Advanced Studies
en_gb: Certificate of Advanced Studies

source: Zertifikatslehrgänge umfassen in der Regel zwischen 100 und 200 Lektionen.
en_gb: Certificate of Advanced Studies (CAS) courses generally comprise between 100 and 200 lessons.

source: Sie dauern 1-2 Semester und schliessen mit einem Certificate of Advanced Studies CAS ab.
en_gb: They last 1 - 2 semesters and culminate in the award of a Certificate of Advanced Studies (CAS).

source: Einzelne Zertifikatslehrgänge können als Teil eines Weiterbildungs-Masterstudiengangs absolviert und für diesen angerechnet werden.
en_gb: Individual CAS courses can be studied as part of a Master of Advanced Studies continuing education degree programme and be credited towards the award of a Master of Advanced Studies degree.

source: Am Departement Angewandte Linguistik können folgende Zertifikatslehrgänge absolviert werden:
en_gb: Currently, the School of Applied Linguistics offers the following CAS courses (in German only):

source: Zulassungs- und Teilnahmebedingungen
en_gb: General terms of admission and participation

source: Weiterbildungskurse
en_gb: Continuing education courses

source: Weiterbildungskurse dauern in der Regel weniger als 100 Lektionen.
en_gb: Continuing education courses generally comprise fewer than 100 lessons.

source: Das Departement Angewandte Linguistik bietet aktuell folgende Weiterbildungskurse an, wobei die meisten Angebote auch individualisiert auf eigene Bedürfnisse als Firmenkurse gebucht werden können:
en_gb: The School of Applied Linguistics currently offers the following courses, most of which can be structured as company training courses to meet the needs of individual corporate clients (in German only):

source: Verarbeiten, auswerten, archivieren
en_gb: Processing, evaluating, archiving

source: Im weitesten Sinne verbindet die Computerlinguistik die Verwendung oder Bearbeitung menschlicher Sprache mit den Möglichkeiten zur Verarbeitung, Auswertung und Archivierung am Computer.
en_gb: Computational linguistics serves to combine the use or processing of human speech and language with all aspects of computer-based processing, evaluation and archiving.

source: Die Arbeitsstelle Computerlinguistik am Institut für Übersetzen und Dolmetschen ist zuständig für Ausbildung und Forschung in den Bereichen Computerlinguistik und Informatik.
en_gb: The IUED’s Centre for Computational Linguistics is responsible for teaching and research in the fields of computational linguistics and information technology.

source: Computerlinguistik und Übersetzen
en_gb: Computational linguistics and translation

source: Warum sollten angehende mehrsprachige Kommunikationsfachleute Kenntnisse in der Computerlinguistik erwerben?
en_gb: Why should future multilingual communications specialists acquire knowledge of computational linguistics?

source: Der Computer wird in Zukunft in unserer Arbeitswelt einen immer grösseren Raum einnehmen.
en_gb: The computer can be expected to assume ever greater prominence in our working lives.

source: Bereits heute sind für viele Arbeitsuchende Basiskenntnisse im Bereich DV und elektronische Kommunikation als Einstellungsvoraussetzung anzusehen.
en_gb: Basic IT and electronic communications skills are already regarded as essential qualifications for many job-seekers today.

source: Speziell für Übersetzer und Dolmetscher werden derzeit computergestützte Anwendungen eingesetzt und weiterentwickelt:
en_gb: A number computer-assisted applications are currently being used and developed specifically for translators and interpreters. Examples include:

source: Respeaking und Audiodeskription
en_gb: Respeaking (Live Subtitling) and Audio Description

source: Mehrsprachige elektronische Lexika und Terminologiedatenbanken
en_gb: Multilingual electronic dictionaries and terminology databases

source: Mehrsprachige Textdatenbanken
en_gb: Multilingual text databases

source: Elektronisch verwaltete und aufbereitete Übersetzungskorpora (Alignments) Arbeitsumgebungen für Übersetzer: CAT (= Computer-Aided Translation), auch in Verbindung mit maschineller Übersetzung (MT = Machine Translation)
en_gb: Electronically managed and generated translation corpora (alignments)

source: Schriftenreihe Angewandte Linguistik und Translationswissenschaft
en_gb: Series of publications on Applied Linguistics and Translation Science

source: In der Schriftenreihe Angewandte Linguistik und Translationswissenschaft werden wissenschaftliche Aufsätze und Forschungsberichte zu den Forschungsschwerpunkten des Instituts publiziert.
en_gb: The series comprises published academic papers and research reports in the areas on which the Institute focuses its research.

source: Bisher in der Reihe erschienen sind folgende Titel:
en_gb: The following papers have been published so far:

source: Forschungsschwerpunkte
en_gb: Areas of research focus

source: Die Forschungs- und Entwicklungsprojekte am IUED befassen sich vor allem mit Fragen aus den folgenden Bereichen:
en_gb: The IUED’s research and development projects focus on the following key areas:

source: Übersetzungs- und Dolmetschwissenschaft
en_gb: Interpreting and Translation Studies

source: Verantwortliche:
en_gb: Project supervisors:

source: Prof., Ph.D. Maureen Ehrensberger-Dow und Prof. Dr. Michaela Albl-Mikasa
en_gb: Prof., Ph.D. Maureen Ehrensberger-Dow and Prof. Dr. Michaela Albl-Mikasa

source: Was sind die besten Übersetzungsstrategien für verschiedene Textsorten?
en_gb: What are the best translation strategies for various types of text?

source: Wie verlaufen Übersetzungsprozesse?
en_gb: What are the sequential steps in translation processes?

source: Was sind Qualitätsmerkmale beim Dolmetschen?
en_gb: What attributes are critical to the quality of interpreting?

source: Wie gehen ÜbersetzerInnen mit elektronischen Ressourcen um?
en_gb: How do translators deploy electronic resources?

source: Wie setzt man E-Learning am besten ein, um Translationskompetenz zu erwerben?
en_gb: How can e-learning best be used to promote the acquisition of translation competence?

source: Wie werden Übersetzungsleistungen evaluiert?
en_gb: How is translation work evaluated?

source: Welche Unterschiede gibt es zwischen professionellen ÜbersetzerInnen und nicht-ausgebildeten SprachmittlerInnen?
en_gb: How do professional translators differ from untrained linguistic intermediaries?

source: Wie kann eine möglichst hohe Kompetenz in den Zweitsprachen erreicht werden?
en_gb: How can the highest possible level of proficiency in second languages be attained?

source: Wie trennen mehrsprachige SprecherInnen die verschiedenen Sprachen?
en_gb: How do people who speak several languages keep their individual languages separate?

source: Wie können mehrsprachige Personen ihre Sprachen pflegen?
en_gb: How do people who speak several languages maintain their proficiency in those languages?

source: Wie wirkt sich die Lebenssituation auf die Sprachkompetenz mehrsprachiger SprecherInnen aus?
en_gb: How do the life circumstances of people speaking several languages affect their linguistic proficiency?

source: Welche computerlinguistischen Methoden eignen sich für die Sammlung, Bearbeitung und Auswertung mehrsprachiger digitaler Texte?
en_gb: What computer linguistics methods are most effective for the collation, processing and evaluation of multilingual digital texts?

source: Wie müssen sprachtechnologische Anwendungen beschaffen sein, um die Datenflut bewältigen zu können?
en_gb: How should language technology applications be designed in order to manage large amounts of data?

source: Was ist der Beitrag der Computerlinguistik zum barrierefreien Zugang zu Informationen?
en_gb: How can computer linguistics support unimpeded access to information?

source: Wie kann man die Bedürfnisse von unterschiedlichen Adressaten eines Textes feststellen und ihnen gerecht werden?
en_gb: How can the needs of individual target readers of a text be identified and addressed?

source: Wie können elektronische Texte effizient nach spezifischen linguistischen Merkmalen aufgefunden bzw. sortiert und ausgewertet werden?
en_gb: How can electronic texts efficiently be identified, classified and evaluated on the basis of specific linguistic attributes?

source: Welche Wirkung haben bestimmte Wörter auf unsere Vorstellungen?
en_gb: How does the use of specific words affect our perceptions of what they are used to describe?

source: Wie kann ein Produkt für bestimmte Adressaten adäquat beschrieben werden?
en_gb: How can a product be appropriately described for specific user groups?

source: Wie kann die Mensch-Maschine-Schnittstelle unter Berücksichtigung des Nutzungskontextes und der jeweiligen normativen Anforderungen adäquat gestaltet werden?
en_gb: How can the man/machine interface best be adapted to the context in which equipment is intended to be used and to the normative requirements placed on such use?

source: Computerlinguistik im Studium am IUED
en_gb: Computational Linguistics in the curriculum

source: Bachelorstudiengang Angewandte Sprachen, Vertiefung Multimodale Kommunikation
en_gb: BA programme in Applied Languages, specialising in multi-modal communication

source: Die Studierenden erhalten eine Übersicht über die grundlegende Struktur von CAT-Software sowie die wichtigsten kommerziellen und nicht-kommerziellen Produkte.
en_gb: Students gain an insight into the fundamental structure of CAT software and the major commercial and open-source CAT products.

source: Anhand von Projektarbeiten in den Bereichen Übersetzen, Untertiteln und Respeaking lernen die Studierenden relevante sprachtechnologische Anwendungen kennen.
en_gb: By working in project groups in the areas of translation, sub-titling and re-narrating, they will be able to familiarise themselves with the relevant language technology applications.

source: Masterstudiengang Angewandte Linguistik
en_gb: MA degree programme in Applied Linguistics

source: Computerlinguistik und Sprachtechnologie I (Vorlesung, mit Übungen für die Vertiefung Fachübersetzen)
en_gb: Computer Linguistics and Language Technology I (course of lectures , with additional exercises for students specialising in Professional Translation)

source: Vermittlung von computerlinguistischen und hierfür relevanten linguistischen Theorien insbesondere in den Bereichen mehrsprachige Terminologie und mehrsprachiges digitales Informationsmanagement.
en_gb: This course acquaints students with computational linguistics and the technologies on which it is based, particularly in the areas of multilingual communication and multilingual digital information management.

source: Computerlinguistik und Sprachtechnologie II (Workshop und Projektarbeit)
en_gb: Computer Linguistics and Language Technology II (workshop and project assignment)

source: Vermittlung von vertieften Kenntnissen im Bereich Translationstechnologie (kommerzielle und freie Anwendungen)
en_gb: Students acquire in-depth knowledge of both commercial and open-source translation technology applications

source: Vermittlung von vertieften Kenntnissen über den Aufbau und die Struktur von Terminologiedatenbanken
en_gb: Students acquire in-depth knowledge of the logic and structure of terminology databases

source: Vermittlung von Kenntnissen über Tools zur Terminologieerkennung und -extraktion
en_gb: Students learn how to use tools for terminology recognition and extraction

source: Projektarbeit: Erstellung von Datenbanken mit kommerzieller CAT-Software: Across, SDL Trados, TransitNXT oder mit frei verfügbaren Tools
en_gb: Project assignment: configuring and populating databases using commercial CAT software applications (Across, SDL Trados or TransitNXT) or free / open-source software

source: In Zusammenarbeit mit der Arbeitsstelle Computerlinguistik und mit Unterstützung des E-Learning-Zentrums der ZHAW entwickeln Dozierende des IUED E-Learning-Kurse zur Unterstützung der Lehre sowie nützliche Tools für den Studien- und Berufsalltag.
en_gb: Working in conjunction with the Centre for Computational Linguistics and with the support of the ZHAW’s E-learning Centre, IUED teaching staff are working on the development of e-learning courses for the IUED curriculum and useful computer-based tools for everyday use by students and working professionals.

source: Computerlizenz für mehrsprachige TranslatorInnen
en_gb: Computer user’s licence for multilingual communication specialists

source: In der Computerlizenz für mehrsprachige TranslatorInnen werden die nötigen Anwendungskenntnisse vermittelt, die den Studien- und Berufsalltag erleichtern sollen.
en_gb: This computer „driving licence“ for mutlilingual communication specialists (in German only) enables students to familiarise themselves with the everyday applications they will be using during their studies and future professional careers.

source: Modul 0:
en_gb: Module 0:

source: Die "Computerlizenz für mehrsprachige TranslatorInnen" wird derzeit für Windows 7 grundlegend überarbeitet.
en_gb: The computer user’s licence for multilingual commmunication specialists is currently undergoing fundamental revision for Windows 7.

source: Tools for Translators bieten angehenden ÜbersetzerInnen das nötige Rüstzeug, um Übersetzungsaufträge abzuwickeln, z.B. Informationen über Workflow, Sprachtechnologie, Übersetzungprozess.
en_gb: Tools for Translators provides translators-to-be with the basic knowledge and basic tools they will need for carrying out translation commissions – e.g. workflow management, language technology, the translation process.

source: Zum Kurs
en_gb: Go to course description

source: Suchdienst Term-minator
en_gb: Term-minator search application

source: Term-minator ist ein mehrsprachiger Suchdienst (italienisch, deutsch, spanisch, französisch), der mithilfe automatisierter Suchfilter andere Suchmaschinen nach der gewünschten Information durchforstet.
en_gb: Term-minator is a multilingual search application (operating in English, Italian, German, Spanish and French) which uses automated search criteria to enable its users to seek specific information by querying other search engines.

source: Zur Startseite
en_gb: Go to home page

source: Columni ist die Ehemaligenorganisation des IAM, organisiert als Verein.
en_gb: Columni is the IAM’s alumni association, which has the legal status of an association (Verein) under Swiss law.

source: Mitglieder sind Absolventinnen und Absolventen des Bachelor-Studiengangs Journalismus und Organisationskommunikation JO.
en_gb: Its members are graduates of the JO bachelor degree programme in Journalism and Organisational Communication.

source: Gegründet wurde Columni 2003, von den ersten IAM-AbsolventInnen.
en_gb: Columni was founded by the first graduates from this programme, in 2003.

source: Ziel des Vereins ist es, einen Mehrwert im beruflichen Alltag der IAM-AbsoventInnen zu schaffen.
en_gb: The association’s purpose is to provide services of value to the day-to-day work of IAM graduates.

source: Zum Beispiel durch Fachreferate zu aktuellen Themen, eine Stellenbörse oder einen Newsletter.
en_gb: Examples of its activities include lectures by specialists on current topics, a job exchange and a newsletter.

source: Regelmässige Socializing-Events stärken das Netzwerk und bieten Gelegenheit, sich in lockerer Atmosphäre auszutauschen und in Verbindung zu bleiben.
en_gb: The association also organises a number of social events which not only strengthen the Columni network but also provide alumni with an opportunity to socialise and exchange ideas in a relaxed atmosphere and to remain in touch with each other.

source: Columni pflegt einen intensiven Dialog mit dem IAM und der ZHAW.
en_gb: Columni maintains close contacts with the IAM and the ZHAW.

source: Der Verein ist Basismitglied der Alumni ZHAW und FHSchweiz, dem Dachverband der Schweizer Fachhochschulabsolventen.
en_gb: It is also a founding member of Alumni ZHAW and FHSchweiz, the umbrella organisation for graduates of Swiss universities of applied sciences.

source: Über 600 Mitglieder, Kommunikationsfachleute und JournalistInnen, bilden ein aktives, landesweites Netzwerk.
en_gb: Its 600-odd members, communications professionals and journalists, have created an active network which covers the whole of Switzerland.

source: Alle weiteren Informationen auf www.columni.ch.
en_gb: Further information is available on www.columni.ch.

source: Columni Executive – Sektion für die Weiterbildungs-AbsolventInnen
en_gb: Columni Executive – the section for former participants in IAM courses of further education

source: Columni Executive ist eine Sektion von Columni. Sie vereinigt die AbsolventInnen der Weiterbildungsangebote des IAM.
en_gb: Columni Executive is a section of Columni, grouping together former participants in IAM courses of further education.

source: Gegründet wurde die Sektion Ende 2005.
en_gb: The section was founded in late 2005.

source: Ziel von Columni Executive ist es, die Verbindung zwischen den ehemaligen Weiterbildungs-Studierenden zu fördern und den Kontakt zu den StudiengangleiterInnen und zum IAM aufrechterhalten.
en_gb: Columni Executive’s purpose is to promote contacts between former participants in IAM courses of further education and to maintain their contacts with the IAM and its programme directors.

source: Alle Columni-Executive-Mitglieder sind automatisch auch Columni Mitglieder (es gelten die gleichen Statuten).
en_gb: All Columni Executive members are automatically also Columni members (the two bodies share the same by-laws).

source: Columni Executive bietet seinen Mitgliedern diverse Vergünstigungen im Bereich der IAM-Weiterbildung und schafft dadurch Anreiz für lebenslanges Lernen, das für den beruflichen Erfolg unverzichtbar geworden ist.
en_gb: Columni Executive offers its members a number of concessionary fee rates on IAM courses of further education, thus providing them with an incentive for the life-long learning which has become indispensable for professional success.

source: Alle weiteren Informationen auf www.columni.ch/executive.
en_gb: Further information is available on www.columni.ch/executive.

source: An regelmässigen gemeinsamen Anlässen haben die Mitglieder von Columni und Columni Executive Gelegenheit, einander kennen zu lernen und das berufliche Netzwerk zu erweitern.
en_gb: Joint events are organised on a regular basis, thus enabling members of Columi and Columni Executive to get to know each other and to extend their networks of professional contacts.

source: Forschung
en_gb: Research
